---
kind: method
id: M:Autodesk.Revit.DB.LinkLoadContent.GetLinkDataPath
source: html/7a8bd27f-1ab0-75be-3779-2599cfa33d5b.htm
---
# Autodesk.Revit.DB.LinkLoadContent.GetLinkDataPath Method

Returns the Link data path owned by this LinkLoadContent object.

## Syntax (C#)
```csharp
public ModelPath GetLinkDataPath()
```

## Returns
The Links data path owned by this LinkLoadContent object.

## Remarks
This path represents the physical location of the
 link. Revit will attempt to load the link from this
 location.